BaseConfiguration/Money_2_0/InformationRegisters/ДатыРасписаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДатыРасписаний</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АктуальнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаРасхода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлановаяОперация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбменВалюты</v8:Type>
						<v8:Type>cfg:DocumentRef.Доход</v8:Type>
						<v8:Type>cfg:DocumentRef.МыВзялиВДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.МыВернулиДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.НамВернулиДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.МыДалиВДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.Перемещение</v8:Type>
						<v8:Type>cfg:DocumentRef.Расход</v8:Type>
						<v8:Type>cfg:DocumentRef.УниверсальнаяОперация</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пропустить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДолга</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДохода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКомиссии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРасхода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВладелецРасписания</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПлановаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

BaseConfiguration/Money_2_0/InformationRegisters/ОперацииШаблонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОперацииШаблонов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПлановаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбменВалюты</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводИзменениеОстатка</v8:Type>
						<v8:Type>cfg:DocumentRef.Доход</v8:Type>
						<v8:Type>cfg:DocumentRef.МыВзялиВДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.МыВернулиДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.НамВернулиДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.МыДалиВДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.Перемещение</v8:Type>
						<v8:Type>cfg:DocumentRef.Расход</v8:Type>
						<v8:Type>cfg:DocumentRef.УниверсальнаяОперация</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбменВалюты</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводИзменениеОстатка</v8:Type>
						<v8:Type>cfg:DocumentRef.Доход</v8:Type>
						<v8:Type>cfg:DocumentRef.МыВзялиВДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.МыВернулиДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.НамВернулиДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.МыДалиВДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.Перемещение</v8:Type>
						<v8:Type>cfg:DocumentRef.Расход</v8:Type>
						<v8:Type>cfg:DocumentRef.УниверсальнаяОперация</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

BaseConfiguration/Money_2_0/AccumulationRegisters/ОборотыПлановыхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ОборотыПлановыхОпераций</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПлановаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РазделБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФинансовыеЦели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КошелькиИСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипПоказателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыБюджетныхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяБюджета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтатьяБюджета</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьГрафаБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафыБюджета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьШаблонОперации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбменВалюты</v8:Type>
						<v8:Type>cfg:DocumentRef.Доход</v8:Type>
						<v8:Type>cfg:DocumentRef.МыВзялиВДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.МыВернулиДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.НамВернулиДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.МыДалиВДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.Перемещение</v8:Type>
						<v8:Type>cfg:DocumentRef.Расход</v8:Type>
						<v8:Type>cfg:DocumentRef.УниверсальнаяОперация</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

BaseConfiguration/Money_2_0/InformationRegisters/ДатыРасписаний/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


// Выполняет проверку корректности записей, исправляет ошибки
Процедура ПроверитьОперацииПоДатамРасписания(БылиОшибки = Ложь) Экспорт
	
	БылиОшибки = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДатыРасписаний.ВладелецРасписания КАК ВладелецРасписания,
	|	ДатыРасписаний.ПлановаяОперация КАК ПлановаяОперация,
	|	ОперацииШаблонов.Операция КАК ОперацияШаблона,
	|	ДатыРасписаний.ПлановаяДата КАК ПлановаяДата,
	|	ДатыРасписаний.АктуальнаяДата КАК АктуальнаяДата,
	|	ДатыРасписаний.Выполнено КАК Выполнено,
	|	ДатыРасписаний.ПлановаяОперация.Проведен КАК ОперацияПроведена
	|ИЗ
	|	РегистрСведений.ДатыРасписаний КАК ДатыРасписаний
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииШаблонов КАК ОперацииШаблонов
	|		ПО (ДатыРасписаний.ВладелецРасписания = ОперацииШаблонов.Шаблон
	|		И ДатыРасписаний.ПлановаяДата = ОперацииШаблонов.ПлановаяДата)
	|ГДЕ
	|	ДатыРасписаний.ВладелецРасписания <> Неопределено
	|	И НЕ ДатыРасписаний.ВладелецРасписания.Ссылка ЕСТЬ NULL
	|	И ДатыРасписаний.ПлановаяОперация <> Неопределено
	|	И НЕ ДатыРасписаний.ПлановаяОперация.Ссылка ЕСТЬ NULL
	|	И (ОперацииШаблонов.Операция = Неопределено
	|		ИЛИ ОперацииШаблонов.Операция.Ссылка ЕСТЬ NULL)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Попытка
			Набор = РегистрыСведений.ОперацииШаблонов.СоздатьНаборЗаписей();
			Набор.Отбор.Шаблон.Установить(Выборка.ВладелецРасписания);
			Набор.Отбор.Операция.Установить(Выборка.ПлановаяОперация);
			
			Запись = Набор.Добавить();
			Запись.Шаблон       = Выборка.ВладелецРасписания;
			Запись.Операция     = Выборка.ПлановаяОперация;
			Запись.ПлановаяДата = Выборка.ПлановаяДата;
	
			Набор.Записать(Истина);
		Исключение
			БылиОшибки = Истина;
			Ошибка = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации("Плановые операции", УровеньЖурналаРегистрации.Ошибка,, Выборка.ПлановаяОперация,
				СтрШаблон("Не удалось записать плановую операцию ""%1"" для шаблона ""%2""
				|%2", Выборка.ПлановаяОперация, Выборка.ВладелецРасписания, ПодробноеПредставлениеОшибки(Ошибка))
				);
		КонецПопытки;
		
		Если Выборка.ОперацияПроведена <> Выборка.Выполнено Тогда
			
			Набор = РегистрыСведений.ДатыРасписаний.СоздатьНаборЗаписей();
			Набор.Отбор.ВладелецРасписания.Установить(Выборка.ВладелецРасписания);
			Набор.Отбор.ПлановаяДата.Установить(Выборка.ПлановаяДата);
			Набор.Прочитать();
			Если Не Набор.Выбран() Тогда
				Продолжить;
			КонецЕсли;
			
			Попытка
				Набор[0].Выполнено = Выборка.ОперацияПроведена;
				Набор.Записать(Истина);
			Исключение
				БылиОшибки = Истина;
				Ошибка = ИнформацияОбОшибке();
				ЗаписьЖурналаРегистрации("Плановые операции", УровеньЖурналаРегистрации.Ошибка,, Выборка.ПлановаяОперация,
					СтрШаблон("Не удалось записать плановую операцию ""%1"" для шаблона ""%2""
					|%2", Выборка.ПлановаяОперация, Выборка.ВладелецРасписания, ПодробноеПредставлениеОшибки(Ошибка))
					);
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьЗаписиРегистра(БылиОшибки = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДатыРасписаний.ВладелецРасписания
	|ИЗ
	|	РегистрСведений.ДатыРасписаний КАК ДатыРасписаний
	|ГДЕ
	|	ДатыРасписаний.ВладелецРасписания.Ссылка ЕСТЬ NULL";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	
		Если Не ЗначениеЗаполнено(Выборка.ВладелецРасписания) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			Набор = РегистрыСведений.ДатыРасписаний.СоздатьНаборЗаписей();
			Набор.Отбор.ВладелецРасписания.Установить(Выборка.ВладелецРасписания);
			Набор.Записать(Истина);
		Исключение
			БылиОшибки = Истина;
			ЗаписьЖурналаРегистрации("Плановые операции", УровеньЖурналаРегистрации.Ошибка,,,
				СтрШаблон("Не удалось очистить записи даты расписания для шаблона ""%1"" (%2)
				|%3", Выборка.ВладелецРасписания, ТипЗнч(Выборка.ВладелецРасписания), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()))
				);
		КонецПопытки;
		
		Попытка
			Набор = РегистрыНакопления.ОборотыПлановыхОпераций.СоздатьНаборЗаписей();
			Набор.Отбор.Регистратор.Установить(Выборка.ВладелецРасписания);
			Набор.Записать(Истина);
		Исключение
			БылиОшибки = Истина;
			ЗаписьЖурналаРегистрации("Плановые операции", УровеньЖурналаРегистрации.Ошибка,,,
				СтрШаблон("Не удалось очистить обороты плановых операций для шаблона ""%1"" (%2)
				|%3", Выборка.ВладелецРасписания, ТипЗнч(Выборка.ВладелецРасписания), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()))
				);
		КонецПопытки;
	
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
